Catalogs/ТипыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ТипыСкидок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазмерСкидки</Name>
					<Comment>Размер скидки в % или аболютном выражении</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индивидуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаСтоимостиОтделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абсолютная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Относительная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадаетсяВДокументе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АбсолютнаяОтСтоимостиВО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплексная</Name>
					<Comment>Состоящая из простых/комплексных скидок</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыСкидок/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#ЕСЛИ НЕ ВНЕШНЕЕСОЕДИНЕНИЕ ТОГДА

// Обработчик события ПриЗаписи объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;			           
	КонецЕсли;  

	Если Не (ВидСкидки = Перечисления.ВидыСкидок.ЗадаетсяВДокументе или ВидСкидки = Перечисления.ВидыСкидок.Комплексная) И Не ЗначениеЗаполнено(РазмерСкидки) Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке("Не задана величина скидки!", Отказ);
	КонецЕсли;
	Если ВидСкидки = Перечисления.ВидыСкидок.Комплексная и Состав.Количество()=0 Тогда 
		ОбменДаннымиСервер.СообщитьОбОшибке("Не указана ни одна скидка в составе!", Отказ);
	КонецЕсли;
	Если ВидСкидки = Перечисления.ВидыСкидок.Комплексная и Состав.Количество()>0 и Состав.НайтиСтроки(новый Структура("Скидка",Справочники.ТипыСкидок.ПустаяСсылка())).Количество()>0 Тогда 
		ОбменДаннымиСервер.СообщитьОбОшибке("В составе есть пустые строки!", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидСкидки) Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке("Не указан вид скидки!", Отказ);
	КонецЕсли;
	Если ВидСкидки = Перечисления.ВидыСкидок.Относительная И РазмерСкидки > 100 Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке("Величина относительной скидки не может превышать 100%!", Отказ);
	КонецЕсли;
	//Если ВидСкидки = Перечисления.ВидыСкидок.Абсолютная И Валюта.Пустая() Тогда
	//	ОбменДаннымиСервер.СообщитьОбОшибке("Не задана валюта для абсолютной скидки!", Отказ);
	//КонецЕсли;
	
КонецПроцедуры

Функция СоставИзменили()
	ссылкаКоличество =  Ссылка.Состав.Количество();
	объектКоличество =  ЭтотОбъект.Состав.Количество();
	Если Не ссылкаКоличество = объектКоличество Тогда 
		Возврат истина;
	КонецЕсли;
	Для сч=0 по ссылкаКоличество-1 Цикл 
		Если Не Ссылка.Состав.Получить(сч).Скидка = ЭтотОбъект.Состав.Получить(сч).Скидка Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КОНЕЦЕСЛИ
